In [1]:
import os

path_brezposelni = "../structured_data"

os.listdir(path_brezposelni)

['najvisja_zaposlenost_obcine_izobrazba.ipynb',
 'po-statisticnah-regijah_trajanje-brezposelnosti.csv',
 'po-statisticnah-regijah_izobrazba.csv',
 'po-obcinah_trajanje-brezposelnosti.csv',
 'po-obcinah_izobrazba.csv',
 'po-statisticnah-regijah_spol.csv',
 'po-statisticnah-regijah_starost.csv',
 'po-uradih-za-delo_trajanje-brezposelnosti.csv',
 'po-uradih-za-delo_izobrazba.csv',
 'zaposleni',
 'po-obcinah_spol.csv',
 'zaposleni_po_obcinah.xlsx',
 'po-obcinah_starost.csv',
 'po-uradih-za-delo_spol.csv',
 'po-uradih-za-delo_starost.csv']

In [2]:
import pandas as pd

brezposelni = pd.read_csv(path_brezposelni + "/po-statisticnah-regijah_starost.csv")
brezposelni.head()

,Kohezijska / \nstatistična regija,15-24\nlet,25-29\nlet,30-39\nlet,40-49\nlet,50-54\nlet,55 let \nali več,Skupaj,month,year
0,Slovenija,6038.0,6667.0,14342.0,14486.0,6998.0,19303.0,67834.0,JAN,2022
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,JAN,2022
2,Vzhodna Slovenija,4036.0,3813.0,7925.0,8051.0,4182.0,11330.0,39337.0,JAN,2022
3,Jugovzhodna Slovenija,601.0,464.0,1055.0,922.0,414.0,1262.0,4718.0,JAN,2022
4,Koroška,239.0,225.0,388.0,467.0,273.0,646.0,2238.0,JAN,2022

In [3]:
# Najprej zamenja vse \r\n v \n (zato da dela na windows in linux)
brezposelni.rename(columns=lambda x: x.replace('\r\n', '\n'), inplace=True)

brezposelni.rename(columns = {"Kohezijska / \nstatistična regija":"regija", "15-24\nlet":"15-24",
                              "25-29\nlet":"25-29", "30-39\nlet":"30-39", "40-49\nlet":"40-49",
                             "50-54\nlet":"50-54", "55 let \nali več":"55+", "Skupaj":"skupaj"}, inplace = True)

In [4]:
brezposelni

,regija,15-24,25-29,30-39,40-49,50-54,55+,skupaj,month,year
0,Slovenija,6038.0,6667.0,14342.0,14486.0,6998.0,19303.0,67834.0,JAN,2022
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,JAN,2022
2,Vzhodna Slovenija,4036.0,3813.0,7925.0,8051.0,4182.0,11330.0,39337.0,JAN,2022
3,Jugovzhodna Slovenija,601.0,464.0,1055.0,922.0,414.0,1262.0,4718.0,JAN,2022
4,Koroška,239.0,225.0,388.0,467.0,273.0,646.0,2238.0,JAN,2022
...,...,...,...,...,...,...,...,...,...,...
261,Goriška,148.0,178.0,382.0,448.0,174.0,606.0,1936.0,FEB,2023
262,Obalno-kraška,212.0,266.0,642.0,765.0,303.0,802.0,2990.0,FEB,2023
263,Osrednjeslovenska,838.0,1253.0,2927.0,2983.0,1276.0,3633.0,12910.0,FEB,2023
264,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,FEB,2023
265,Občina izven RS,94.0,143.0,300.0,247.0,73.0,110.0,967.0,FEB,2023

In [5]:
brezposelni = brezposelni.dropna(subset=["regija"])
brezposelni.head()

,regija,15-24,25-29,30-39,40-49,50-54,55+,skupaj,month,year
0,Slovenija,6038.0,6667.0,14342.0,14486.0,6998.0,19303.0,67834.0,JAN,2022
2,Vzhodna Slovenija,4036.0,3813.0,7925.0,8051.0,4182.0,11330.0,39337.0,JAN,2022
3,Jugovzhodna Slovenija,601.0,464.0,1055.0,922.0,414.0,1262.0,4718.0,JAN,2022
4,Koroška,239.0,225.0,388.0,467.0,273.0,646.0,2238.0,JAN,2022
5,Podravska,1196.0,1259.0,2479.0,2489.0,1338.0,3285.0,12046.0,JAN,2022

In [6]:
path_zaposleni = "../structured_data/zaposleni"

os.listdir(path_zaposleni)

['zaposleni_po_regijah.xlsx', 'old', 'zaposleni_po_obcinah.xlsx']

In [7]:
zaposleni = pd.read_excel(path_zaposleni + "/zaposleni_po_regijah.xlsx", header=[0, 1])
zaposleni.head()

  Unnamed: 0_level_0   15-24                                                  \
  Unnamed: 0_level_1 2010M01 2010M02 2010M03 2010M04 2010M05 2010M06 2010M07
0           SLOVENIA   38654   38277   37915   37485   36886   36609   35836
1           Pomurska    1915    1926    1930    1965    1962    1983    1973
2          Podravska    5366    5332    5326    5244    5125    5076    5014
3            Koroška    1390    1362    1342    1326    1303    1309    1277
4          Savinjska    5059    4964    4884    4852    4824    4797    4671

                   ...     60+                                          \
  2010M08 2010M09  ... 2022M05 2022M06 2022M07 2022M08 2022M09 2022M10
0   35185   35592  ...   55673   56451   56830   57502   57618   58328
1    1939    1891  ...    2970    3010    3022    3041    3069    3110
2    4956    5003  ...    8603    8761    8893    8988    8971    9070
3    1258    1263  ...    1807    1821    1854    1886    1892    1918
4    4617    4703  ...    6225    6310    6344    6442    6434    6513


  2022M11 2022M12 2023M01 2023M02
0   58982   59845   57739   58017
1    3145    3177    3035    3052
2    9153    9396    8944    8997
3    1943    1980    1892    1889
4    6579    6661    6435    6472

[5 rows x 1423 columns]

In [8]:
# Združi ('age', 'date') -> 'age__TEMP__date'
zaposleni.columns = ['__TEMP__'.join(col) for col in zaposleni.columns]
zaposleni.head()
len(zaposleni.columns[1:])

1422

In [9]:
regija = 'Unnamed: 0_level_0' + '__TEMP__'+ 'Unnamed: 0_level_1'

# This melts columns which are inside value_vars into rows,
# id_vars pa pusti kot identifiers. (lahko damo samo to vrednost)
# The melted columns are assigned to 'age + date' and 'value' using the var_name and value_name parameters, respectively.
# v var_name daš kako bo ime stolpcu, ki bo vseboval 'imena prejšnjih stolpcev'
# v value_name pa daš kako bo ime stolpcu, ki bo mel vrednosti
# Ta melted df nej bi mel 1422 krat več vrstic ((13 let * 12 mesecev + 2 meseca) * 9 age range)

melted_zaposleni = zaposleni.melt(
                    id_vars=zaposleni.columns[0],
                    #value_vars=zaposleni.columns[1:],
                    var_name='age + date',
                    value_name='value')

melted_zaposleni.rename(columns = {regija:"regija"}, inplace = True)

print('prej st. vrstic: ' + str(len(zaposleni)))
print('melted st. vrstic: ' + str(len(melted_zaposleni)))
print('1422 * prej = ' + str(len(zaposleni) * 1422))

melted_zaposleni.head()

prej st. vrstic: 13
melted st. vrstic: 18486
1422 * prej = 18486

      regija            age + date  value
0   SLOVENIA  15-24__TEMP__2010M01  38654
1   Pomurska  15-24__TEMP__2010M01   1915
2  Podravska  15-24__TEMP__2010M01   5366
3    Koroška  15-24__TEMP__2010M01   1390
4  Savinjska  15-24__TEMP__2010M01   5059

In [10]:
# Split the 'age + date' column into 2 separate columns
melted_zaposleni[['age', 'date']] = melted_zaposleni['age + date'].str.split('__TEMP__', expand=True)
melted_zaposleni = melted_zaposleni.drop('age + date', axis=1)
melted_zaposleni.head()

      regija  value    age     date
0   SLOVENIA  38654  15-24  2010M01
1   Pomurska   1915  15-24  2010M01
2  Podravska   5366  15-24  2010M01
3    Koroška   1390  15-24  2010M01
4  Savinjska   5059  15-24  2010M01

In [11]:
# Split the 'date' column into 2 separate columns
melted_zaposleni[["year", "month"]] = melted_zaposleni["date"].str.split("M", expand=True)
melted_zaposleni = melted_zaposleni.drop('date', axis=1)
melted_zaposleni.head()

      regija  value    age  year month
0   SLOVENIA  38654  15-24  2010    01
1   Pomurska   1915  15-24  2010    01
2  Podravska   5366  15-24  2010    01
3    Koroška   1390  15-24  2010    01
4  Savinjska   5059  15-24  2010    01

In [12]:
melted_zaposleni["year"] = melted_zaposleni["year"].astype(int)
melted_zaposleni["month"] = melted_zaposleni["month"].astype(int)

# zbrisem vse pred 2018, ker nimamo podatkov o brezposelnih pred 2018
melted_zaposleni = melted_zaposleni[melted_zaposleni["year"] >= 2018]
melted_zaposleni.head()

         regija  value    age  year  month
1248   SLOVENIA  36452  15-24  2018      1
1249   Pomurska   1817  15-24  2018      1
1250  Podravska   5103  15-24  2018      1
1251    Koroška   1418  15-24  2018      1
1252  Savinjska   4985  15-24  2018      1

In [13]:
# Zdej bom kr probal se spremenit brezposelni df v obliko, ki je melted_zaposleni
brezposelni.head()

,regija,15-24,25-29,30-39,40-49,50-54,55+,skupaj,month,year
0,Slovenija,6038.0,6667.0,14342.0,14486.0,6998.0,19303.0,67834.0,JAN,2022
2,Vzhodna Slovenija,4036.0,3813.0,7925.0,8051.0,4182.0,11330.0,39337.0,JAN,2022
3,Jugovzhodna Slovenija,601.0,464.0,1055.0,922.0,414.0,1262.0,4718.0,JAN,2022
4,Koroška,239.0,225.0,388.0,467.0,273.0,646.0,2238.0,JAN,2022
5,Podravska,1196.0,1259.0,2479.0,2489.0,1338.0,3285.0,12046.0,JAN,2022

In [14]:
# This melts columns ['15-24', '25-29'...] into rows, (inside value_vars)
# while keeping the ['regija', 'month', 'year'] columns as identifiers.
# value_vars is optional (ker id_vars unija value_vars so vsi stolpci)
# The melted columns are assigned to 'age' and 'value' using the var_name and value_name parameters, respectively.
# v var_name daš kako bo ime stolpcu, ki bo vseboval 'age range'
# v value_name pa daš kako bo ime stolpcu, ki bo mel vrednosti
# Ta melted df nej bi mel 7 krat več vrstic

brezposelni_melted = brezposelni.melt(
    id_vars=['regija', 'month', 'year'],
    #value_vars=['15-24', '25-29', '30-39', '40-49', '50-54', '55+', 'skupaj'],
    var_name='age',
    value_name='value')

print('prej st. vrstic: ' + str(len(brezposelni)))
print('melted st. vrstic: ' + str(len(brezposelni_melted)))
print('7 * prej = ' + str(len(brezposelni) * 7))

brezposelni_melted.head()

prej st. vrstic: 224
melted st. vrstic: 1568
7 * prej = 1568

                  regija month  year    age   value
0              Slovenija   JAN  2022  15-24  6038.0
1      Vzhodna Slovenija   JAN  2022  15-24  4036.0
2  Jugovzhodna Slovenija   JAN  2022  15-24   601.0
3                Koroška   JAN  2022  15-24   239.0
4              Podravska   JAN  2022  15-24  1196.0

In [15]:
# Map month names to numbers
month_mapping = {
    "JAN": 1,
    "FEB": 2,
    "MAR": 3,
    "APR": 4,
    "MAY": 5,
    "JUN": 6,
    "JUL": 7,
    "AUG": 8,
    "SEP": 9,
    "OCT": 10,
    "NOV": 11,
    "DEC": 12,
}
brezposelni_melted["month"] = brezposelni_melted["month"].map(month_mapping)
brezposelni_melted.head()

                  regija  month  year    age   value
0              Slovenija    1.0  2022  15-24  6038.0
1      Vzhodna Slovenija    1.0  2022  15-24  4036.0
2  Jugovzhodna Slovenija    1.0  2022  15-24   601.0
3                Koroška    1.0  2022  15-24   239.0
4              Podravska    1.0  2022  15-24  1196.0

In [16]:
# Change order of columns
new_order = ['regija', 'value', 'age', 'year', 'month']
brezposelni_melted = brezposelni_melted[new_order]
brezposelni_melted.head()

                  regija   value    age  year  month
0              Slovenija  6038.0  15-24  2022    1.0
1      Vzhodna Slovenija  4036.0  15-24  2022    1.0
2  Jugovzhodna Slovenija   601.0  15-24  2022    1.0
3                Koroška   239.0  15-24  2022    1.0
4              Podravska  1196.0  15-24  2022    1.0

In [17]:
# regija to UPPER
brezposelni_melted["regija"] = brezposelni_melted["regija"].str.upper()

In [18]:
# BREZPOSELNI
print(brezposelni_melted["age"].unique())
brezposelni_melted.head()

['15-24' '25-29' '30-39' '40-49' '50-54' '55+' 'skupaj']

                  regija   value    age  year  month
0              SLOVENIJA  6038.0  15-24  2022    1.0
1      VZHODNA SLOVENIJA  4036.0  15-24  2022    1.0
2  JUGOVZHODNA SLOVENIJA   601.0  15-24  2022    1.0
3                KOROŠKA   239.0  15-24  2022    1.0
4              PODRAVSKA  1196.0  15-24  2022    1.0

In [19]:
# ZAPOSLENI
melted_zaposleni = melted_zaposleni.reset_index(drop=True)

print(melted_zaposleni["age"].unique())
melted_zaposleni.head()

['15-24' '25-29' '30-34' '35-39' '40-44' '45-49' '50-54' '55-59' '60+']

      regija  value    age  year  month
0   SLOVENIA  36452  15-24  2018      1
1   Pomurska   1817  15-24  2018      1
2  Podravska   5103  15-24  2018      1
3    Koroška   1418  15-24  2018      1
4  Savinjska   4985  15-24  2018      1

In [21]:
# Treba še da bo age range enak na obeh. Torej zmanjšam tisto, ki ima več (zaposleni)